Revit 2026 API

# ElectricalLoadAreaData Class

---

Represents the electrical load area data.

SystemObject Autodesk.Revit.DBSpatialElementDomainData Autodesk.Revit.DB.ElectricalElectricalLoadAreaData

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElectricalLoadAreaData : SpatialElementDomainData
```
```vb
Public Class ElectricalLoadAreaData
	Inherits SpatialElementDomainData
```
```cpp
public ref class ElectricalLoadAreaData : public SpatialElementDomainData
```
```fsharp
type ElectricalLoadAreaData =
    class
        inherit SpatialElementDomainData
    end
```

The ElectricalLoadAreaData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from SpatialElementDomainData) |

|  | Name | Description |
| --- | --- | --- |
|  | CreateElectricalLoadAreas | Creates electrical load areas on all the empty plan circuits of the given level. |
|  | Dispose | (Inherited from SpatialElementDomainData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAreaBasedLoadIds | Gets the area based load ids of the electrical load area to be included. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | HasCircuitsWithoutElectricalLoadAreas | Checks whether there are any empty plan circuits in which there are no electrical load areas. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Electrical Namespace